# Creating new tables

In [8]:
import sqlite3
import pandas as pd

con = sqlite3.connect("university_professors.db")
cur = con.cursor()
cur.execute("""CREATE TABLE professors (
                firstname text,
                lastname text
               );"""
               )

con.close()

In [9]:
# connect to database
con = sqlite3.connect("university_professors.db")
cur = con.cursor()

In [10]:
pd.read_sql("""SELECT * 
               FROM professors
               ;""", 
            con)

Empty DataFrame
Columns: [firstname, lastname]
Index: []

In [11]:
cur.execute("""CREATE TABLE universities (
                university_shortname text,
                university text,
                university_city text
               );"""
               )

In [12]:
pd.read_sql("""SELECT * 
               FROM universities
               ;""", 
            con)

Empty DataFrame
Columns: [university_shortname, university, university_city]
Index: []

## Adding columns to existing tables is easy, especially if they're still empty.

To add columns you can use the following SQL query:

```
ALTER TABLE table_name
ADD COLUMN column_name data_type;
```

In [15]:
cur.execute("""ALTER TABLE professors
               ADD COLUMN university_shortname text
               ;"""
               )

In [16]:
pd.read_sql("""SELECT * 
               FROM professors
               ;""", 
            con)

Empty DataFrame
Columns: [firstname, lastname, university_shortname]
Index: []